window.onload = function (){
	//判断打太鼓的键盘按下事件，计算score（分数没怎么做）
	var score = 0
	document.getElementById("tt").defaultValue = 0
	this.onkeydown = function (event){
		if(event.keyCode == 70){
			document.getElementById("s1").play()
			if(dis<60 && dis>20 && tgarr[0]==0){
				score++
				document.getElementById("tt").value = score
			}
		}
		if(event.keyCode == 74){
			document.getElementById("s2").play()
			if(dis<60 && dis>20 && tgarr[0]==1){
				score++
				document.getElementById("tt").value = score
			}
		}
	}
	
	//载入2张太鼓图片
	var picnum = 2
	var tgt = document.getElementById("tgs").getContext("2d")
	var tgimg1 = new Image()
	var cant = 0
	tgimg1.src="tg1.png"
	tgimg1.onload = function (){
		cant++
		if(cant > picnum - 1){
			runtgs()
		}
	}
	var tgimg2 = new Image()
	tgimg2.src="tg2.png"
	tgimg2.onload = function (){
		cant++
		if(cant > picnum - 1){
			runtgs()
		}
	}
	
	//画圆+线，表示太鼓正确敲打的位置
	var uit = document.getElementById("uis").getContext("2d")
	uit.beginPath();
	uit.arc(65,70,50,0,Math.PI*2,true);
	uit.moveTo(65,0)
	uit.lineTo(65,150)
	uit.strokeStyle = "#ffffff"
	uit.stroke()
	
	//设置太鼓y轴位置
	//disarr是每个太鼓的间距
	//tgarr指示太鼓类型
	var n
	var vx
	var vy = 30
	var disarr = new Array(60,60,30,60,60,60,30,60,30,60,
60,60,30,60,30,60,30,30,60,60,
60,60,30,60,60,60,30,60,30,60,
60,60,30,60,30,60,30,30,60,60,
60,60,30,60,60,60,30,60,30,60,
60,60,30,60,30,60,30,30,60,60,
60,60,30,60,60,60,30,60,30,60,
60,60,30,60,30,60,30,30,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,120,120,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
120,60,60,120,60,300,
60,120,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60,
60,60,60,60,60,60,60,60)
	var tgarr = new Array(0,0,0,1,0,0,0,1,0,1,
0,0,0,1,0,1,0,1,0,0,
0,0,0,1,0,0,0,1,0,1,
0,0,0,1,0,1,0,1,0,0,
0,0,0,1,0,0,0,1,0,1,
0,0,0,1,0,1,0,1,0,0,
0,0,0,1,0,0,0,1,0,1,
0,0,0,1,0,1,0,1,0,0,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,0,1,0,0,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,0,1,0,0,0,
0,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1,
0,1,1,0,1,1,0,1)
	var dis= 280//第一个太鼓距离终点的初始位置
	var isover = false
	function runtgs(){
		tgt.clearRect(0,0,500,100)//把太鼓全部清除
		vx = dis//更新第一个太鼓距离终点的位置
		if(vx<0){
			if(tgarr.length < 2){
				alert("over")
				isover = true
				return;
			}
			vx = disarr[0];
			//如果vx<0，说明第一个太鼓已失效
			//将其类型、间距从数组移除，第二个太鼓再次顶替到数组[0]索引处
			disarr.shift()
			tgarr.shift()
		}
		vx -=2.9 
		dis = vx
		//以下是根据间距重新画太鼓，且只画x轴0~500范围内的
		for(n=0;n<20;n++){
			if(tgarr[n] == 0){
				tgt.drawImage(tgimg1,vx,vy)
			}else if(tgarr[n] == 1){
				tgt.drawImage(tgimg2,vx,vy)
			}
			vx += disarr[n]
			if(vx>500){
				break;
			}
		}
		if(!isover){
			setTimeout(runtgs,1)
		}
	}
}